---
kind: method
id: M:Autodesk.Revit.DB.DirectShapeType.RemoveAllReferenceObjects
source: html/dd4587c6-f138-751c-f840-787486f6513a.htm
---
# Autodesk.Revit.DB.DirectShapeType.RemoveAllReferenceObjects Method

Removes all reference objects (if any) from the DirectShapeType.

## Syntax (C#)
```csharp
public void RemoveAllReferenceObjects()
```